Tekla Open API Reference for Tekla Structures 2025
AnalysisMaterial.MaterialTypeEnum Enumeration
 The material types.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum MaterialTypeEnum
Public Enumeration MaterialTypeEnum
Members
Member name | Value | Description
STEEL | 1 |  The steel material type.
CONCRETE | 2 |  The concrete material type.
TIMBER | 5 |  The timber material type.
See Also
Reference
Tekla.Structures.Analysis Namespace